cases/steckler/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    sides
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    base
    {
        type            noSlip;
    }
    burner
    {
        type            flowRateInletVelocity;
        massFlowRate    table
        
3
(
(0 0.03)
(60 0.03)
(100 0.03)
)
;
        value           uniform (0 0 0);
    }
    floor
    {
        type            noSlip;
    }
    baffle1DWall_master
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    baffle1DWall_slave
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
