cases/steckler/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    top
    {
        type            calculated;
        value           uniform 101325;
    }
    sides
    {
        type            calculated;
        value           uniform 101325;
    }
    base
    {
        type            calculated;
        value           uniform 101325;
    }
    burner
    {
        type            calculated;
        value           uniform 101325;
    }
    floor
    {
        type            calculated;
        value           uniform 101325;
    }
    baffle1DWall_master
    {
        type            calculated;
        value           uniform 101325;
    }
    baffle1DWall_slave
    {
        type            calculated;
        value           uniform 101325;
    }
}


// ************************************************************************* //
