cases/steckler/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            prghTotalHydrostaticPressure;
        ph_rghName      ph_rgh;
        value           uniform 0;
    }
    sides
    {
        type            prghTotalHydrostaticPressure;
        ph_rghName      ph_rgh;
        value           uniform 0;
    }
    base
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    burner
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    floor
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    baffle1DWall_master
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    baffle1DWall_slave
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
}


// ************************************************************************* //
