cases/steckler/constant/pyrolysisProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      pyrolysisProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

active          true;

pyrolysisModel  reactingOneDim;

regionName pyrolysisRegion;

reactingOneDimCoeffs
{
    filmCoupled     true;

    radFluxName     Qr;

    moveMesh        false; // true;
    minimumDelta    1e-6;
}


// ************************************************************************* //
