cases/steckler/constant/pyrolysisZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      pyrolysisZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pyrolysis
{
    active          false;

    pyrolysisModel  none;

    regionName      none;

    reactingOneDim21Coeffs
    {
        gasHSource      no; //Energy source term due to pyrolysis gas
        QrHSource       no; //Energy source term due in depth radiation

        filmCoupled     true;

        radFluxName     Qr;

        moveMesh        false; // true;
        minimumDelta    1e-6;
    }
    infoOutput      true;
}


// ************************************************************************* //
